DELETE FROM ts_ref_data WHERE ref_tab_id = 611;
DELETE FROM ts_ref_data WHERE ref_tab_id = 617;
DELETE FROM ts_ref_data WHERE ref_tab_id = 618;

INSERT INTO ts_ref_data (ref_tab_id, ref_dat_ide, ref_dat_code, ref_dat_desc, ref_dat_desc_en, ref_dat_value1, ref_dat_value2, sort_index, sta_rec_id, dt_cre, usr_cre, dt_upd, usr_upd) 
VALUES
    -- EGuarantorFlawsCategory
    (611, 1,  '01',         'BlackList',     'BlackList',             null, null, 1, 1, now(), 'admin', now(), 'admin'),
    (611, 2,  '02',         'NCB',           'NCB',                   null, null, 1, 1, now(), 'admin', now(), 'admin'),
    (611, 3,  '03',         'Policy',        'Policy',                null, null, 1, 1, now(), 'admin', now(), 'admin'),

	--EDecisionCategory
    (617, 1,  '01',         'BlackList',     'BlackList',             null, null, 1, 1, now(), 'admin', now(), 'admin'),
    (617, 2,  '02',         'NCB',           'NCB',                   null, null, 1, 1, now(), 'admin', now(), 'admin'),
    (617, 3,  '03',         'Policy',        'Policy',                null, null, 1, 1, now(), 'admin', now(), 'admin'),

	--EDecision
	(618, 1,  'B01',        'ลูกค้าแก็งฑ์',                   'ลูกค้าแก็งฑ์',               1, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 2,  'B02',        'พฤติกรรมน่าสงสัย',               'พฤติกรรมน่าสงสัย',            1, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 3,  'B03',        'ปลอมเปลงเอกสาร',                'ปลอมเปลงเอกสาร',           1, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 4,  'B04',        'ข้อมูลเท็จ',                    'ข้อมูลเท็จ',                1, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 5,  'B05',        'บริษัทฯที่ลูกค้าทำงานมีพฤติกรรมน่าสงสัย',    'บริษัทฯที่ลูกค้าทำงานมีพฤติกรรมน่าสงสัย', 1, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 6,  'B06',        'Fraud อื่นๆ',                'Fraud อื่นๆ',            1, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 7,  'B99',        'อื่นๆ',                       'อื่นๆ',                   1, null, 1, 1, now(), 'admin', now(), 'admin'),

	(618, 8,  'N01',        'บุคคลล้มละลาย',                 'บุคคลล้มละลาย',             2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 9,  'N02',        'รถยึด',                      'รถยึด',                  2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 10, 'N03',        'ลูกค้าเก่าประวัติไม่ดี',               'ลูกค้าเก่าประวัติไม่ดี',           2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 11, 'N04',        'NCB=>50,001 บาท ',          'NCB=>50,001 บาท ',      2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 12, 'N05',        'NCB=20,001-50,000 บาท',    'NCB=20,001-50,000 บาท', 2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 13, 'N06',        'NCB=5,001-20,000 บาท',     'NCB=5,001-20,000 บาท',  2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 14, 'N07',        'NCB=<5,000 บาท',           'NCB=<5,000 บาท',        2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 15, 'N08',        'NCB',                    'NCB',                  2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 16, 'N09',        'สินเชื่อจักรยานยนต์คันที่2ไม่ตามเกณฑ์',      'สินเชื่อจักรยานยนต์คันที่2ไม่ตามเกณฑ์',  2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 17, 'N10',        'ภาระหนี้เกินเกณฑ์',                'ภาระหนี้เกินเกณฑ์',            2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 18, 'N11',        'มีรายการยื่นเรื่องขอสินเชื่อเช่าซื้อก่อนหน้า',    'มีรายการยื่นเรื่องขอสินเชื่อเช่าซื้อก่อนหน้า', 2, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 19, 'NH99',       'อื่นๆ',                       'อื่นๆ',                   2, null, 1, 1, now(), 'admin', now(), 'admin'),

	(618, 20, 'P01',        'อาชีพ-ไม่ชัดเจน',                 'อาชีพ-ไม่ชัดเจน',              3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 21, 'P02',        'ที่พักอาศัย-ไม่ชัดเจน',               'ที่พักอาศัย-ไม่ชัดเจน',            3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 22, 'P03',        'เอกสารสำคัญ-ไม่ครบ/สมบูรณ์',          'เอกสารสำคัญ-ไม่ครบ/สมบูรณ์',       3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 23, 'P04',        'ซื้อแทน',                     'ซื้อแทน',                  3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 24, 'P05',        'เบอร์ซ้ำ-ที่พัก/เบอร์โทรที่เดียวกันกับลูกค้าGLมีปัญหา', 'เบอร์ซ้ำ-ที่พัก/เบอร์โทรที่เดียวกันกับลูกค้าGLมีปัญหา', 3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 25, 'P06',        'ไม่เข้าหลักเกณฑ์-ลูกค้าพม่า',            'ไม่เข้าหลักเกณฑ์-ลูกค้าพม่า',        3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 26, 'P07',        'ไม่เข้าหลักเกณฑ์-ลูกค้าต่างชาติ',          'ไม่เข้าหลักเกณฑ์-ลูกค้าต่างชาติ',       3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 27, 'P08',        'กลุ่มอาชีพ-ไม่ตามเกณฑ์',             'กลุ่มอาชีพ-ไม่ตามเกณฑ์',          3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 28, 'P09',        'เอกสารการเงิน-ไม่ล่าสุด',             'เอกสารการเงิน-ไม่ล่าสุด',          3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 29, 'P10',        'ไม่มี-ผู้ค้ำประกัน',                 'ไม่มี-ผู้ค้ำประกัน',              3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 30, 'P11',        'ไม่เข้า-เงื่อนไขพิเศษ',               'ไม่เข้า-เงื่อนไขพิเศษ',            3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 31, 'P12',        'ไม่อยู่ในพื้นที่ให้บริการขอบริษัทฯ',        'ไม่อยู่ในพื้นที่ให้บริการขอบริษัทฯ',      3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 32, 'P13',        'มีรายการยื่นเรื่องขอสินเชื่อเช่าซื้อก่อนหน้า',    'มีรายการยื่นเรื่องขอสินเชื่อเช่าซื้อก่อนหน้า',  3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 33, 'P14',        'รายได้-ไม่ตามเกณฑ์',               'รายได้-ไม่ตามเกณฑ์',            3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 34, 'P15',        'อายุงาน-ไม่ตามเกณฑ์',              'อายุงาน-ไม่ตามเกณฑ์',            3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 35, 'P16',        'อายุตัว-ไม่ตามเกณฑ์',               'อายุตัว-ไม่ตามเกณฑ์',            3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 36, 'P17',        'โทรศัพท์-ไม่ตามเกณฑ์',              'โทรศัพท์-ไม่ตามเกณฑ์',           3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 37, 'P18',        'ลูกค้าเก่า-ไม่เข้าหลักเกณฑ์',            'ลูกค้าเก่า-ไม่เข้าหลักเกณฑ์',          3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 38, 'P19',        'ระยะที่พักอาศัย-ไม่ตามเกณฑ์',          'ระยะที่พักอาศัย-ไม่ตามเกณฑ์',         3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 39, 'P20',        'ผู้ค้ำประกัน-ไม่เข้าหลักเกณฑ์',           'ผู้ค้ำประกัน-ไม่เข้าหลักเกณฑ์',         3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 40, 'P21',        'บริษัทที่ลูกค้าทำงานขาดส่งงบดุลมากกว่า3ปี',    'บริษัทที่ลูกค้าทำงานขาดส่งงบดุลมากกว่า3ปี',  3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 41, 'P22',        'ยอดจัดเกินกว่าตารางยอดจัด',           'ยอดจัดเกินกว่าตารางยอดจัด',          3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 42, 'P23',        'รถจักรยานยนต์รุ่นนอกตาราง',           'รถจักรยานยนต์รุ่นนอกตาราง',         3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 43, 'P24',        'ดอกเบี้ยขั้นต่ำไม่ตามเกณฑ์',            'ดอกเบี้ยขั้นต่ำไม่ตามเกณฑ์',          3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 44, 'P25',        'จำนวนงวดไม่ตามเกณฑ์',             'จำนวนงวดไม่ตามเกณฑ์',            3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 45, 'P26',        'ไม่มี-ผู้อ้างอิง',                   'ไม่มี-ผู้อ้างอิง',                 3, null, 1, 1, now(), 'admin', now(), 'admin'),
	(618, 46, 'P99',        'อื่นๆ',                       'อื่นๆ',                      3, null, 1, 1, now(), 'admin', now(), 'admin');